
## Plan Result

[CI link](https://github.com/na2na-p/sns-app/actions/runs/3979492327)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * aws_iam_instance_profile.sns-app-backend_for_ssm
  * aws_instance.na2na-sns-app-backend


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_instance_profile.sns-app-backend_for_ssm must be replaced
-/+ resource "aws_iam_instance_profile" "sns-app-backend_for_ssm" {
      ~ arn         = "arn:aws:iam::778544234120:instance-profile/sns-app-backend_for_ssm" -> (known after apply)
      ~ create_date = "2023-01-22T11:39:07Z" -> (known after apply)
      ~ id          = "sns-app-backend_for_ssm" -> (known after apply)
      ~ name        = "sns-app-backend_for_ssm" -> "na2na-ci_ssm" # forces replacement
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
      ~ unique_id   = "AIPA3KRG2H2EBTGVVHVNG" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_instance.na2na-sns-app-backend must be replaced
-/+ resource "aws_instance" "na2na-sns-app-backend" {
      ~ arn                                  = "arn:aws:ec2:ap-northeast-1:778544234120:instance/i-01ab9764a70593f61" -> (known after apply)
      ~ availability_zone                    = "ap-northeast-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ iam_instance_profile                 = "sns-app-backend_for_ssm" -> "na2na-ci_ssm"
      ~ id                                   = "i-01ab9764a70593f61" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ key_name                             = "" -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      ~ outpost_arn                          = "" -> (known after apply)
      ~ password_data                        = "" -> (known after apply)
      ~ placement_group                      = "" -> (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-007f6031d2f9fcdda" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-232.ap-northeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.232" -> (known after apply)
      ~ public_dns                           = "" -> (known after apply)
      ~ public_ip                            = "13.231.110.164" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ tags                                 = {
          ~ "Name" = "na2na-sns-app-backend" -> "backend-ci"
        }
      ~ tags_all                             = {
          ~ "Name" = "na2na-sns-app-backend" -> "backend-ci"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "e74ef767eceab9f2166c25a56a2d69b87e1c25db" -> "" # forces replacement
      + user_data_base64                     = (known after apply)
        # (7 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-06f876702dce56846" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"EC2-Plan","PRNumber":111,"Program":"tfcmt","SHA1":"1195c72d5bafe1d99da84cb768d4aaf5ece08325","Vars":{},"WorkflowName":"Terraform Plan"} -->